In [123]:
import pandas as pd

In [124]:
import matplotlib.pyplot as plt

In [125]:
file = 'data/kunden.csv'

df = pd.read_csv(file, decimal = " " )

df.head()

  Alter;Einkommen;Preis;Geschlecht;Zeit;KundeNr
0            64;66894.0;88160.31;1.0;43.0;K0310
1            54;77644.0;103145.7;1.0;40.0;K1042
2            55;44341.0;80565.16;0.0;37.0;K0382
3            49;67271.0;83949.89;0.0;42.0;K0498
4            46;49832.0;93781.58;0.0;41.0;K0552

In [126]:
df.to_csv('data/kunden_neu.csv', sep = ";")

In [127]:
df.head()

  Alter;Einkommen;Preis;Geschlecht;Zeit;KundeNr
0            64;66894.0;88160.31;1.0;43.0;K0310
1            54;77644.0;103145.7;1.0;40.0;K1042
2            55;44341.0;80565.16;0.0;37.0;K0382
3            49;67271.0;83949.89;0.0;42.0;K0498
4            46;49832.0;93781.58;0.0;41.0;K0552

In [128]:
df.isnull().sum()

Alter;Einkommen;Preis;Geschlecht;Zeit;KundeNr    0
dtype: int64

In [129]:
df.dropna(inplace = True)
df.reset_index(drop=True, inplace = True)
df

     Alter;Einkommen;Preis;Geschlecht;Zeit;KundeNr
0               64;66894.0;88160.31;1.0;43.0;K0310
1               54;77644.0;103145.7;1.0;40.0;K1042
2               55;44341.0;80565.16;0.0;37.0;K0382
3               49;67271.0;83949.89;0.0;42.0;K0498
4               46;49832.0;93781.58;0.0;41.0;K0552
...                                            ...
1099           70;69581.0;103751.58;1.0;51.0;K0467
1100            38;48301.0;64230.98;1.0;33.0;K0122
1101           67;63547.0;103123.57;1.0;41.0;K1045
1102            37;32686.0;49215.87;1.0;36.0;K1096
1103           55;71240.0;106132.59;1.0;49.0;K0861

[1104 rows x 1 columns]